*** Sentences end with a single space
    In my world, sentences end with a single space. This makes
    sentence navigation commands work for me (Sacha Chua).
    But in elisp mode!

#+BEGIN_SRC emacs-lisp
  (setq sentence-end-double-space nil
        sentence-end "[.?!][]\"')]*\\($\\|\t\\| \\)[ \t\n]*")

  (defun brust-elisp-sentence-end-double-sapce-t nil
    (mapc #'make-local-variable '(sentence-end-double-space sentence-end))
    (setq sentence-end nil
          sentence-end-double-space t))

    (add-hook 'emacs-lisp-mode-hook
              #'brust-elisp-sentence-end-double-sapce-t)
#+END_SRC

#+RESULTS:
| y-sp | brust-elisp-sentence-end-double-sapce-t | n-auto-fill |

**** My customization
#+BEGIN_SRC elisp
  (setq-default
   mode-line-format
   '("%e"
     ;;   mode-line-mule-info
     ;;   mode-line-client
     ;; Position, including warning for 80 columns
     ;; (:propertize " --[" face mode-line-bars-face)
     (:propertize "|| " face mode-line-bars-face)
     mode-line-misc-info
     (:propertize "|\[" face mode-line-bars-face)
     (:propertize "%l" face sml/line-number)
     (:eval (propertize (format "/%s" (line-number-at-pos (point-max))) 'face 'mode-line-top-line-number))
     (:propertize ":" face sml/line-number)
     (:eval (propertize "%c" 'face
                        (if (< (current-column) 80)
                            'sml/col-number
                          'mode-line-80col-face)))
     (:eval (propertize (format "/%s" (- (line-end-position) (line-beginning-position))) 'face 'mode-line-top-line-number))
     (:propertize "\]|" face mode-line-bars-face)
     ;; (:propertize "|| " face mode-line-bars-face)
     (:eval
      (cond (buffer-read-only
             (propertize " RO " 'face 'mode-line-read-only-face))
            ((buffer-modified-p)
             (propertize " ** " 'face 'mode-line-modified-face))))
     (:eval (if (or buffer-read-only (buffer-modified-p))
                (propertize "| " 'face 'mode-line-bars-face)
              " "))
     ;; mode-line-front-space
     ;;      (vc-mode vc-mode)
     ;; sml/pre-modes-separator
     mode-line-frame-identification
     mode-line-buffer-identification
     (:propertize "|| " face mode-line-bars-face)
     mode-line-modes
     (:propertize "| " face mode-line-bars-face)
     (vc-mode vc-mode)
     (vc-mode vc-status)
     (:propertize "||" face mode-line-bars-face)
     ;; nyan-create
     '(:eval '(nyan-create))
     ;;(:eval (list (nyan-create)))
     ;;(:propertize "||" face mode-line-bars-face)
     mode-line-position
     (:propertize "||%-" face mode-line-bars-face)
     mode-line-end-spaces))
#+END_SRC

#+RESULTS:
| %e | (:propertize |   | face mode-line-bars-face) | mode-line-misc-info | (:propertize | [ face mode-line-bars-face) | (:propertize %l face sml/line-number) | (:eval (propertize (format /%s (line-number-at-pos (point-max))) (quote face) (quote mode-line-top-line-number))) | (:propertize : face sml/line-number) | (:eval (propertize %c (quote face) (if (< (current-column) 80) (quote sml/col-number) (quote mode-line-80col-face)))) | (:eval (propertize (format /%s (- (line-end-position) (line-beginning-position))) (quote face) (quote mode-line-top-line-number))) | (:propertize ] | face mode-line-bars-face) | (:eval (cond (buffer-read-only (propertize  RO  (quote face) (quote mode-line-read-only-face))) ((buffer-modified-p) (propertize  **  (quote face) (quote mode-line-modified-face))))) | (:eval (if (or buffer-read-only (buffer-modified-p)) (propertize | (quote face) (quote mode-line-bars-face))  )) | mode-line-frame-identification | mode-line-buffer-identification | mode-line-modes | (:propertize | face mode-line-bars-face) | (vc-mode vc-mode) | (vc-mode vc-status) | (:propertize |   | face mode-line-bars-face) | (quote (:eval (quote (nyan-create)))) | mode-line-position | (:propertize |   | %- face mode-line-bars-face) | mode-line-end-spaces |

*** Hippie Expand
#+BEGIN_SRC elisp
  (setq hippie-expand-try-functions-list
        '(try-complete-file-name-partially
          try-complete-file-name
          pcomplete
          try-expand-all-abbrevs
          ;; try-expand-list
          try-expand-dabbrev
          ;; try-expand-by-dict
          ))
#+END_SRC

#+RESULTS:
| try-complete-file-name-partially | try-complete-file-name | pcomplete | try-expand-all-abbrevs | try-expand-dabbrev |

**** Little Org-ref

#+BEGIN_SRC elisp
  (use-package org-ref
    :after org
    :init
    (setq org-ref-default-bibliography
          '("~/Dropbox/bibliography/my.bib")
          org-ref-bibliography-notes "~/Dropbox/bibliography/notes.org"
          org-ref-completion-library 'org-ref-ivy-cite
          org-ref-pdf-directory "~/Dropbox/bibliography/pdf")

    (setq bibtex-autokey-year-length 4
          bibtex-autokey-name-year-separator "-"
          bibtex-autokey-year-title-separator "-"
          bibtex-autokey-titleword-separator "-"
          bibtex-autokey-titlewords 2
          bibtex-autokey-titlewords-stretch 1
          bibtex-autokey-titleword-length 5)

    (add-hook 'LaTeX-mode-hook (lambda nil
                                 (require 'org-ref)
                                 (require 'org-ref-latex)))
    :config
    (require 'org-ref-ivy)
    (require 'org-ref-latex)
    (require 'org-ref-bibtex)
    (require 'org-ref-pdf)
    ;; (key-chord-define-global "kk" 'org-ref-cite-hydra/body)
    ;; (global-set-key (kbd "s-n") 'org-ref-bibtex-hydra/body)
    ;; (use-package org-autolist
    ;;   :after org-ref
    ;;   :config
    ;;   (org-autolist-mode +1))
    ;; 
    ;; ;;      (use-package doi-utils
    ;; ;;        :after org)
    ;; 
    ;; (use-package org-ref-bibtex;;
    ;;   :after org
    ;;   :init
    ;;   (setq org-ref-bibtex-hydra-key-binding "\C-cj"))
    )
#+END_SRC

#+RESULTS:
| (lambda nil (require (quote org-ref)) (require (quote org-ref-latex))) | org-ref-latex-cite-on | er/add-latex-mode-expansions | flyspell-ignore-tex | outline-minor-mode | flyspell-mode | turn-on-reftex | LaTeX-math-mode | turn-on-cdlatex | visual-fill-column-mode | aggressive-indent-mode |
**** Lists
#+BEGIN_SRC elisp
  (defvar brust-file-list-list nil "List of association list of file/dir paths. Used by `xah-open-file-fast'. Key is a short abbrev string, Value is file path string.")

  (setq
   brust-file-list-list
   '((xah-filelist . (
                      ("Doc-Org"    . "~/Dropbox/Org/Doc.org")
                      ("Th-master"  . "~/Dropbox/Math/Doctorat_Laura/Thesis/master.tex")
                      ("My-theory"  . "~/Dropbox/Math/Doctorat11/Apunts/basic-algebraic-geometry.tex")
                      ("Com-in-Alg" . "~/Dropbox/Math/Doctorat_Laura/Com_in_Alg/PauBrustenga_Urcf4.tex")
		      ))
     (config-files . (
                      ("Org-init"     . "~/.emacs.d/init.org")
                      ("el-init"      . "~/.emacs.d/init.el")
                      ("LaTeX-config" . "~/.emacs.d/lisp/brusts-latex-config.org")
		      ))
     (org-files    . (
                      ("My-Org"   . "~/Dropbox/Org/my.org")
                      ("Recetari" . "~/Dropbox/Org/recetari.org")
                      ("Travels"  . "~/Dropbox/Org/travels.org")
                      ("Media"    . "~/Dropbox/Org/MyMedia.org")
                      ("Doctorat" . "~/Dropbox/Org/Doc.org")
                      ))))
#+END_SRC

#+RESULTS:
| xah-filelist | (Doc-Org . ~/Dropbox/Org/Doc.org) | (Th-master . ~/Dropbox/Doctorat_Laura/Thesis/master.tex) | (My-theory . ~/Dropbox/Doctorat11/Apunts/basic-algebraic-geometry.tex) | (Com-in-Alg . ~/Dropbox/Doctorat_Laura/Com_in_Alg/PauBrustenga_Urcf4.tex) |                                    |
| config-files | (Org-init . ~/.emacs.d/init.org)  | (el-init . ~/.emacs.d/init.el)                           | (LaTeX-config . ~/.emacs.d/lisp/brusts-latex-config.org)               |                                                                           |                                    |
| org-files    | (My-Org . ~/Dropbox/Org/my.org)   | (Recetari . ~/Dropbox/Org/recetari.org)                  | (Travels . ~/Dropbox/Org/travels.org)                                  | (Media . ~/Dropbox/Org/MyMedia.org)                                       | (Doctorat . ~/Dropbox/Org/Doc.org) |

***** Org block template alist
#+BEGIN_SRC elisp
  (eval-after-load "org"
    '(cl-pushnew
      '("not" "#+BEGIN_NOTES\n?\n#+END_NOTES")
      org-structure-template-alist))
#+END_SRC

#+RESULTS:
| not | #+BEGIN_NOTES |

